#include <iostream>
#include <ctime>
#include <cstring>
#include "search.h"
#include "Tasks.h"
#include "print_TASKS.h"
#include "Menu.h"
#include "Files.h"
using namespace std;

//Створіть додаток «Список справ».Додаток має давати можливість :
//
// Додавати справи.Справа має :
//		-назву;         v
//		-пріоритет;     v
//		-опис;          v   
//		-дату та час виконання.     v
//	Видаляти справи.        v   
//	Редагувати справи.      v
//	Пошук справ за :    v    -доработать некоректно работает V
//		-назвою;        v   
//		-пріоритетом;   v  
//		-описом;        v
//		-датою та часом виконання.      доделать траблы
// Відображати список справ :   v
//		-на день;               ----
//		-на тиждень;            ----
//		-на місяць.             ----
//  Добавить файловую систему
// При відображенні має бути можливість сортування :
//		-за пріоритетом;
//		-за датою та часом виконання.








int main()
{
    menu();

    return 0;
}